export const QUESTION_SET_V1 = [
  // Pattern A Direct/Explicit Concept
  // มี mention ชัดเจนเกี่ยวกับทักษะหรือหัวข้อที่ต้องการเรียนรู้
  // Topic Based
  'มีวิชาสอนการบริหารเงินตัวเองไหม',
  'สนใจภาษาจีน เริ่มยังไงดี',

  // Skill Based
  'อยากพัฒนาทักษะการวิเคราะห์งบการเงิน',
  'มีวิชาเกี่ยวกับ OOP บ้างไหม',

  // Task Based
  'การสร้างเว็บไซต์ต้องมีทักษะอะไรบ้าง',
  'การจะทำอาหารไทยได้ ต้องเรียนรู้อะไรบ้าง',

  // Role Based
  'อยากเป็น Tiktoker มีวิชาสอนอะไรแนวนี้บ้าง',
  'อยากเป็นนักพัฒนาเกม ต้องมีทักษะอะไรบ้าง เรียนวิชาอะไรดี',

  // Pattern B Outcome/Goal-Oriented
  // มีเป้าหมายหรือผลลัพธ์ที่ต้องการเรียนรู้ แต่ไม่ได้ระบุทักษะหรือหัวข้อโดยตรง
  'อยากพัฒนาตัวเองให้ทำงานสายเทคโนโลยีได้ ต้องมีทักษะอะไรบ้าง มีวิชาแนะนำไหม',
  'อยากคุยกับคนจีนได้ ต้องเรียนอะไรบ้าง',
  'อยากใช้ AI ในชีวิตประจำวันได้',
  'อยากแก้โจทย์ Leetcode ได้โหดๆ มีวิชาแนะนำป่าว',

  // Pattern C Multi-Concept or Transition between concepts
  'อยากเรียนภาษาจีน หรือไม่ก็ภาษาเวียตนาม มีวิชาแนะนำไหม',

  // TODO: see this question
  'อยากเอา AI มาประยุกต์ใช้ในการวิเคราะห์รายงานทางการเงิน มีวิชาแนะนำไหม', // ลองเทีนบเอา query ไปเสิร์ชตรงๆ topN 50 โดยไม่ skill expand ดู จะไม่เจอเกี่ยวกับ AI เลย
];
